; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-5nodes-1000size-3degree-100mindistance-2trucks-5packages-539seed

(define (problem transport-two-cities-sequential-5nodes-1000size-3degree-100mindistance-2trucks-5packages-539seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 807,69 -> 711,379
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 33)
  ; 711,379 -> 807,69
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 33)
  ; 219,315 -> 711,379
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 50)
  ; 711,379 -> 219,315
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 50)
  ; 219,315 -> 241,67
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 25)
  ; 241,67 -> 219,315
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 25)
  ; 980,543 -> 711,379
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 32)
  ; 711,379 -> 980,543
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 32)
  ; 980,543 -> 807,69
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 51)
  ; 807,69 -> 980,543
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 51)
  ; 2515,231 -> 2982,441
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 52)
  ; 2982,441 -> 2515,231
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 52)
  ; 2337,510 -> 2515,231
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 34)
  ; 2515,231 -> 2337,510
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 34)
  ; 2653,875 -> 2337,510
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 49)
  ; 2337,510 -> 2653,875
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 49)
  ; 2936,561 -> 2982,441
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 13)
  ; 2982,441 -> 2936,561
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 13)
  ; 2936,561 -> 2653,875
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 43)
  ; 2653,875 -> 2936,561
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 43)
  ; 980,543 <-> 2337,510
  (road city-1-loc-5 city-2-loc-3)
  (= (road-length city-1-loc-5 city-2-loc-3) 136)
  (road city-2-loc-3 city-1-loc-5)
  (= (road-length city-2-loc-3 city-1-loc-5) 136)
  (at package-1 city-1-loc-5)
  (at package-2 city-1-loc-5)
  (at package-3 city-1-loc-3)
  (at package-4 city-1-loc-2)
  (at package-5 city-1-loc-4)
  (at truck-1 city-2-loc-5)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-3)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-5)
  (at package-2 city-2-loc-2)
  (at package-3 city-2-loc-4)
  (at package-4 city-2-loc-3)
  (at package-5 city-2-loc-2)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-3 city-1-loc-5)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-1-loc-5)
   goals met: 0 of 5
2. (pick-up truck-2 city-1-loc-5 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-1-loc-5) (capacity truck-2 capacity-2)
   added: (in package-1 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 5
3. (drive truck-2 city-1-loc-5 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-5)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 5
4. (pick-up truck-2 city-1-loc-3 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-1-loc-3) (capacity truck-2 capacity-1)
   added: (in package-3 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 5
5. (drive truck-1 city-2-loc-5 city-2-loc-4)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-2-loc-4)
   goals met: 0 of 5
6. (drive truck-1 city-2-loc-4 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-2-loc-3)
   goals met: 0 of 5
7. (drive truck-1 city-2-loc-3 city-1-loc-5)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-1-loc-5)
   goals met: 0 of 5
8. (pick-up truck-1 city-1-loc-5 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-1-loc-5) (capacity truck-1 capacity-3)
   added: (in package-2 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 5
9. (drive truck-1 city-1-loc-5 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-5)
   added: (at truck-1 city-1-loc-1)
   goals met: 0 of 5
10. (drive truck-1 city-1-loc-1 city-1-loc-4)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-4)
   goals met: 0 of 5
11. (pick-up truck-1 city-1-loc-4 package-5 capacity-1 capacity-2)
   deleted: (at package-5 city-1-loc-4) (capacity truck-1 capacity-2)
   added: (in package-5 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 5
12. (drive truck-1 city-1-loc-4 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 5
13. (pick-up truck-1 city-1-loc-2 package-4 capacity-0 capacity-1)
   deleted: (at package-4 city-1-loc-2) (capacity truck-1 capacity-1)
   added: (in package-4 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 5
14. (drive truck-2 city-1-loc-3 city-1-loc-5)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-5)
   goals met: 0 of 5
15. (drive truck-2 city-1-loc-5 city-2-loc-3)
   deleted: (at truck-2 city-1-loc-5)
   added: (at truck-2 city-2-loc-3)
   goals met: 0 of 5
16. (drive truck-2 city-2-loc-3 city-2-loc-4)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-2-loc-4)
   goals met: 0 of 5
17. (drive truck-1 city-1-loc-2 city-1-loc-4)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-4)
   goals met: 0 of 5
18. (drive truck-1 city-1-loc-4 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-1-loc-1)
   goals met: 0 of 5
19. (drive truck-1 city-1-loc-1 city-1-loc-5)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-5)
   goals met: 0 of 5
20. (drive truck-1 city-1-loc-5 city-2-loc-3)
   deleted: (at truck-1 city-1-loc-5)
   added: (at truck-1 city-2-loc-3)
   goals met: 0 of 5
21. (drop truck-1 city-2-loc-3 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-0)
   added: (at package-4 city-2-loc-3) (capacity truck-1 capacity-1)
   goals met: 1 of 5
22. (drive truck-1 city-2-loc-3 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-2)
   goals met: 1 of 5
23. (drop truck-1 city-2-loc-2 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-1)
   added: (at package-2 city-2-loc-2) (capacity truck-1 capacity-2)
   goals met: 2 of 5
24. (drop truck-1 city-2-loc-2 package-5 capacity-2 capacity-3)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-2)
   added: (at package-5 city-2-loc-2) (capacity truck-1 capacity-3)
   goals met: 3 of 5
25. (drop truck-2 city-2-loc-4 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-0)
   added: (at package-3 city-2-loc-4) (capacity truck-2 capacity-1)
   goals met: 4 of 5
26. (drive truck-2 city-2-loc-4 city-2-loc-5)
   deleted: (at truck-2 city-2-loc-4)
   added: (at truck-2 city-2-loc-5)
   goals met: 4 of 5
27. (drop truck-2 city-2-loc-5 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-1)
   added: (at package-1 city-2-loc-5) (capacity truck-2 capacity-2)
   goals met: 5 of 5
